src/InformationRegisters/СвязиСущностей/СвязиСущностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязиСущностей</name>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Кампания</name>
    <type>
      <types>CatalogRef.Кампании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>DefinedType.СущностиКампании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСвязи</name>
    <type>
      <types>CatalogRef.ТипыСвязей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>DefinedType.СущностиКампании</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ТипыСвязей/ТипыСвязей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыСвязей</name>
  <predefined>
    <items>
      <name>СвязанС</name>
      <description>Связан с</description>
    </items>
    <items>
      <name>НаходитсяВ</name>
      <description>Находится в</description>
    </items>
    <items>
      <name>Владеет</name>
      <description>Владеет</description>
    </items>
    <items>
      <name>СостоитВ</name>
      <description>Состоит в</description>
    </items>
    <items>
      <name>ВыдалКвест</name>
      <description>Выдал квест</description>
    </items>
    <items>
      <name>Союзник</name>
      <description>Союзник</description>
    </items>
    <items>
      <name>Враг</name>
      <description>Враг</description>
    </items>
    <items>
      <name>Знаком</name>
      <description>Знаком</description>
    </items>
  </predefined>
  <attributes>
    <name>ОбратноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Симметричная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/СвязиСущностей/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Прикладная логика работы со связями игровых сущностей.
// Все операции записи и чтения регистра СвязиСущностей должны
// выполняться через данный модуль, чтобы UI и будущий AI-слой
// не обращались к регистру напрямую.
//

#Область ПрограммныйИнтерфейс

// Добавляет связь между двумя сущностями активной кампании.
// Если связь уже существует - повторно не создается.
// При необходимости обновляет комментарий у существующей записи.
//
// Параметры:
//  Источник      - ОпределяемыйТип.СущностиКампании - объект-источник связи.
//  ТипСвязи      - СправочникСсылка.ТипыСвязей      - тип устанавливаемой связи.
//  Назначение    - ОпределяемыйТип.СущностиКампании - объект-назначение связи.
//  Комментарий   - Строка                           - произвольный комментарий (необязательный).
//
Процедура ДобавитьСвязь(Источник, ТипСвязи, Назначение, Комментарий = "") Экспорт

	ПроверитьВозможностьОперации(Источник, ТипСвязи, Назначение);

	АктивнаяКампания = АктивнаяКампания();
	РеквизитыТипаСвязи = РеквизитыТипаСвязи(ТипСвязи);
	Симметричная = РеквизитыТипаСвязи.Симметричная;

	НайденнаяЗапись = НайтиЗаписьСвязи(АктивнаяКампания, Источник, Назначение, ТипСвязи, Симметричная);

	Если НайденнаяЗапись = Неопределено Тогда
		СоздатьЗаписьСвязи(АктивнаяКампания, Источник, Назначение, ТипСвязи, Комментарий);
	КонецЕсли;

	Если НайденнаяЗапись <> Неопределено
		И НайденнаяЗапись.Комментарий <> Комментарий Тогда
		ОбновитьКомментарийЗаписи(НайденнаяЗапись, Комментарий);
	КонецЕсли;

КонецПроцедуры

// Удаляет связь между двумя сущностями активной кампании.
// Для симметричной связи поиск ведется без учета направления.
// Если связь не найдена - исключение не возникает.
//
// Параметры:
//  Источник    - ОпределяемыйТип.СущностиКампании - объект-источник связи.
//  ТипСвязи    - СправочникСсылка.ТипыСвязей      - тип удаляемой связи.
//  Назначение  - ОпределяемыйТип.СущностиКампании - объект-назначение связи.
//
Процедура УдалитьСвязь(Источник, ТипСвязи, Назначение) Экспорт

	ПроверитьЗаполнениеПараметров(Источник, ТипСвязи, Назначение);

	АктивнаяКампания = АктивнаяКампания();
	Симметричная = РеквизитыТипаСвязи(ТипСвязи).Симметричная;

	НайденнаяЗапись = НайтиЗаписьСвязи(АктивнаяКампания, Источник, Назначение, ТипСвязи, Симметричная);

	Если НайденнаяЗапись <> Неопределено Тогда
		НаборЗаписей = РегистрыСведений.СвязиСущностей.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Кампания.Установить(НайденнаяЗапись.Кампания);
		НаборЗаписей.Отбор.Источник.Установить(НайденнаяЗапись.Источник);
		НаборЗаписей.Отбор.Назначение.Установить(НайденнаяЗапись.Назначение);
		НаборЗаписей.Отбор.ТипСвязи.Установить(НайденнаяЗапись.ТипСвязи);
		НаборЗаписей.Записать();
	КонецЕсли;

КонецПроцедуры

// Возвращает все связи объекта (исходящие и входящие) активной кампании
// единым списком в унифицированном представлении.
//
// Параметры:
//  Объект - ОпределяемыйТип.СущностиКампании - анализируемая сущность.
//
// Возвращаемое значение:
//  Массив из Структура:
//    * Объект             - ОпределяемыйТип.СущностиКампании
//    * СвязанныйОбъект    - ОпределяемыйТип.СущностиКампании
//    * ТипСвязи           - СправочникСсылка.ТипыСвязей
//    * ПредставлениеСвязи - Строка
//    * Направление        - Строка
//    * Комментарий        - Строка
//
Функция ПолучитьСвязи(Объект) Экспорт

	Результат = Новый Массив;

	Если НЕ ЗначениеЗаполнено(Объект) Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Кампания", АктивнаяКампания());
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СвязиСущностей.Источник КАК Источник,
		|	СвязиСущностей.Назначение КАК Назначение,
		|	СвязиСущностей.ТипСвязи КАК ТипСвязи,
		|	СвязиСущностей.Комментарий КАК Комментарий,
		|	ТипыСвязей.Наименование КАК НаименованиеТипа,
		|	ТипыСвязей.ОбратноеНаименование КАК ОбратноеНаименование,
		|	ТипыСвязей.Симметричная КАК Симметричная
		|ИЗ
		|	РегистрСведений.СвязиСущностей КАК СвязиСущностей
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыСвязей КАК ТипыСвязей
		|		ПО СвязиСущностей.ТипСвязи = ТипыСвязей.Ссылка
		|ГДЕ
		|	СвязиСущностей.Кампания = &Кампания
		|	И СвязиСущностей.Источник = &Объект
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СвязиСущностей.Источник,
		|	СвязиСущностей.Назначение,
		|	СвязиСущностей.ТипСвязи,
		|	СвязиСущностей.Комментарий,
		|	ТипыСвязей.Наименование,
		|	ТипыСвязей.ОбратноеНаименование,
		|	ТипыСвязей.Симметричная
		|ИЗ
		|	РегистрСведений.СвязиСущностей КАК СвязиСущностей
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыСвязей КАК ТипыСвязей
		|		ПО СвязиСущностей.ТипСвязи = ТипыСвязей.Ссылка
		|ГДЕ
		|	СвязиСущностей.Кампания = &Кампания
		|	И СвязиСущностей.Назначение = &Объект";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(ОписаниеСвязи(Объект, Выборка));
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Возвращает исходящие связи объекта в активной кампании
// (объект выступает источником связи).
//
// Параметры:
//  Объект - ОпределяемыйТип.СущностиКампании - анализируемая сущность.
//
// Возвращаемое значение:
//  Массив из Структура - см. ПолучитьСвязи().
//
Функция ПолучитьИсходящиеСвязи(Объект) Экспорт

	Результат = Новый Массив;

	Если НЕ ЗначениеЗаполнено(Объект) Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Кампания", АктивнаяКампания());
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СвязиСущностей.Источник КАК Источник,
		|	СвязиСущностей.Назначение КАК Назначение,
		|	СвязиСущностей.ТипСвязи КАК ТипСвязи,
		|	СвязиСущностей.Комментарий КАК Комментарий,
		|	ТипыСвязей.Наименование КАК НаименованиеТипа,
		|	ТипыСвязей.ОбратноеНаименование КАК ОбратноеНаименование,
		|	ТипыСвязей.Симметричная КАК Симметричная
		|ИЗ
		|	РегистрСведений.СвязиСущностей КАК СвязиСущностей
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыСвязей КАК ТипыСвязей
		|		ПО СвязиСущностей.ТипСвязи = ТипыСвязей.Ссылка
		|ГДЕ
		|	СвязиСущностей.Кампания = &Кампания
		|	И СвязиСущностей.Источник = &Объект";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(ОписаниеСвязи(Объект, Выборка));
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Возвращает входящие связи объекта в активной кампании
// (объект выступает назначением связи).
//
// Параметры:
//  Объект - ОпределяемыйТип.СущностиКампании - анализируемая сущность.
//
// Возвращаемое значение:
//  Массив из Структура - см. ПолучитьСвязи().
//
Функция ПолучитьВходящиеСвязи(Объект) Экспорт

	Результат = Новый Массив;

	Если НЕ ЗначениеЗаполнено(Объект) Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Кампания", АктивнаяКампания());
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СвязиСущностей.Источник КАК Источник,
		|	СвязиСущностей.Назначение КАК Назначение,
		|	СвязиСущностей.ТипСвязи КАК ТипСвязи,
		|	СвязиСущностей.Комментарий КАК Комментарий,
		|	ТипыСвязей.Наименование КАК НаименованиеТипа,
		|	ТипыСвязей.ОбратноеНаименование КАК ОбратноеНаименование,
		|	ТипыСвязей.Симметричная КАК Симметричная
		|ИЗ
		|	РегистрСведений.СвязиСущностей КАК СвязиСущностей
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыСвязей КАК ТипыСвязей
		|		ПО СвязиСущностей.ТипСвязи = ТипыСвязей.Ссылка
		|ГДЕ
		|	СвязиСущностей.Кампания = &Кампания
		|	И СвязиСущностей.Назначение = &Объект";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(ОписаниеСвязи(Объект, Выборка));
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Проверяет наличие связи между двумя сущностями в активной кампании.
// Для симметричной связи учитывает оба направления.
//
// Параметры:
//  Источник    - ОпределяемыйТип.СущностиКампании - объект-источник связи.
//  ТипСвязи    - СправочникСсылка.ТипыСвязей      - тип проверяемой связи.
//  Назначение  - ОпределяемыйТип.СущностиКампании - объект-назначение связи.
//
// Возвращаемое значение:
//  Булево - Истина, если связь существует.
//
Функция СвязьСуществует(Источник, ТипСвязи, Назначение) Экспорт

	Если НЕ ЗначениеЗаполнено(Источник)
		ИЛИ НЕ ЗначениеЗаполнено(Назначение)
		ИЛИ НЕ ЗначениеЗаполнено(ТипСвязи) Тогда
		Возврат Ложь;
	КонецЕсли;

	Симметричная = РеквизитыТипаСвязи(ТипСвязи).Симметричная;
	Возврат НайтиЗаписьСвязи(АктивнаяКампания(), Источник, Назначение, ТипСвязи, Симметричная) <> Неопределено;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает активную кампанию из параметров сеанса.
//
// Возвращаемое значение:
//  СправочникСсылка.Кампании
//
Функция АктивнаяКампания()

	Возврат ПараметрыСеанса.АктивнаяКампания;

КонецФункции

// Возвращает кампанию-владельца переданной игровой сущности.
// Все справочники определяемого типа "СущностиКампании" имеют
// владельца - справочник "Кампании".
//
// Параметры:
//  Сущность - ОпределяемыйТип.СущностиКампании
//
// Возвращаемое значение:
//  СправочникСсылка.Кампании
//
Функция ПолучитьКампаниюСущности(Сущность)

	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Сущность, "Владелец");
	Возврат ЗначенияРеквизитов.Владелец;

КонецФункции

// Возвращает реквизиты элемента справочника ТипыСвязей.
//
// Параметры:
//  ТипСвязи - СправочникСсылка.ТипыСвязей
//
// Возвращаемое значение:
//  Структура:
//    * Наименование         - Строка
//    * ОбратноеНаименование - Строка
//    * Симметричная         - Булево
//
Функция РеквизитыТипаСвязи(ТипСвязи)

	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ТипСвязи, "Наименование, ОбратноеНаименование, Симметричная");

КонецФункции

// Проверяет значение на принадлежность определяемому типу "СущностиКампании".
//
// Параметры:
//  Значение - Произвольный
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоСущностьКампании(Значение)

	Возврат Метаданные.ОпределяемыеТипы.СущностиКампании.Тип.СодержитТип(ТипЗнч(Значение));

КонецФункции

// Комплексная проверка возможности выполнения операции записи.
Процедура ПроверитьВозможностьОперации(Источник, ТипСвязи, Назначение)

	Если НЕ ЗначениеЗаполнено(АктивнаяКампания()) Тогда
		ВызватьИсключение НСтр("ru = 'Не заполнена активная кампания. Операция со связями невозможна.'");
	КонецЕсли;

	ПроверитьЗаполнениеПараметров(Источник, ТипСвязи, Назначение);

	Если ПолучитьКампаниюСущности(Источник) <> АктивнаяКампания() Тогда
		ВызватьИсключение НСтр("ru = 'Источник связи не принадлежит активной кампании.'");
	КонецЕсли;

	Если ПолучитьКампаниюСущности(Назначение) <> АктивнаяКампания() Тогда
		ВызватьИсключение НСтр("ru = 'Назначение связи не принадлежит активной кампании.'");
	КонецЕсли;

КонецПроцедуры

// Проверяет базовое заполнение обязательных параметров связи.
Процедура ПроверитьЗаполнениеПараметров(Источник, ТипСвязи, Назначение)

	Если НЕ ЗначениеЗаполнено(Источник) Тогда
		ВызватьИсключение НСтр("ru = 'Не заполнен источник связи.'");
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Назначение) Тогда
		ВызватьИсключение НСтр("ru = 'Не заполнено назначение связи.'");
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ТипСвязи) Тогда
		ВызватьИсключение НСтр("ru = 'Не заполнен тип связи.'");
	КонецЕсли;

	Если Источник = Назначение Тогда
		ВызватьИсключение НСтр("ru = 'Источник и назначение связи совпадают.'");
	КонецЕсли;

	Если НЕ ЭтоСущностьКампании(Источник) Тогда
		ВызватьИсключение НСтр("ru = 'Источник не является игровой сущностью.'");
	КонецЕсли;

	Если НЕ ЭтоСущностьКампании(Назначение) Тогда
		ВызватьИсключение НСтр("ru = 'Назначение не является игровой сущностью.'");
	КонецЕсли;

КонецПроцедуры

// Ищет существующую запись регистра по заданным параметрам.
// Для симметричной связи учитывает оба направления.
//
// Параметры:
//  Кампания     - СправочникСсылка.Кампании
//  Источник     - ОпределяемыйТип.СущностиКампании
//  Назначение   - ОпределяемыйТип.СущностиКампании
//  ТипСвязи     - СправочникСсылка.ТипыСвязей
//  Симметричная - Булево
//
// Возвращаемое значение:
//  Неопределено - если запись не найдена.
//  Структура:
//    * Кампания    - СправочникСсылка.Кампании
//    * Источник    - ОпределяемыйТип.СущностиКампании
//    * Назначение  - ОпределяемыйТип.СущностиКампании
//    * ТипСвязи    - СправочникСсылка.ТипыСвязей
//    * Комментарий - Строка
//
Функция НайтиЗаписьСвязи(Кампания, Источник, Назначение, ТипСвязи, Симметричная)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Кампания", Кампания);
	Запрос.УстановитьПараметр("Источник", Источник);
	Запрос.УстановитьПараметр("Назначение", Назначение);
	Запрос.УстановитьПараметр("ТипСвязи", ТипСвязи);

	Если Симметричная Тогда
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	СвязиСущностей.Кампания КАК Кампания,
			|	СвязиСущностей.Источник КАК Источник,
			|	СвязиСущностей.Назначение КАК Назначение,
			|	СвязиСущностей.ТипСвязи КАК ТипСвязи,
			|	СвязиСущностей.Комментарий КАК Комментарий
			|ИЗ
			|	РегистрСведений.СвязиСущностей КАК СвязиСущностей
			|ГДЕ
			|	СвязиСущностей.Кампания = &Кампания
			|	И СвязиСущностей.ТипСвязи = &ТипСвязи
			|	И СвязиСущностей.Источник = &Источник
			|	И СвязиСущностей.Назначение = &Назначение
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	СвязиСущностей.Кампания,
			|	СвязиСущностей.Источник,
			|	СвязиСущностей.Назначение,
			|	СвязиСущностей.ТипСвязи,
			|	СвязиСущностей.Комментарий
			|ИЗ
			|	РегистрСведений.СвязиСущностей КАК СвязиСущностей
			|ГДЕ
			|	СвязиСущностей.Кампания = &Кампания
			|	И СвязиСущностей.ТипСвязи = &ТипСвязи
			|	И СвязиСущностей.Источник = &Назначение
			|	И СвязиСущностей.Назначение = &Источник";
	Иначе
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	СвязиСущностей.Кампания КАК Кампания,
			|	СвязиСущностей.Источник КАК Источник,
			|	СвязиСущностей.Назначение КАК Назначение,
			|	СвязиСущностей.ТипСвязи КАК ТипСвязи,
			|	СвязиСущностей.Комментарий КАК Комментарий
			|ИЗ
			|	РегистрСведений.СвязиСущностей КАК СвязиСущностей
			|ГДЕ
			|	СвязиСущностей.Кампания = &Кампания
			|	И СвязиСущностей.ТипСвязи = &ТипСвязи
			|	И СвязиСущностей.Источник = &Источник
			|	И СвязиСущностей.Назначение = &Назначение";
	КонецЕсли;

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();

	ОписаниеЗаписи = Новый Структура;
	ОписаниеЗаписи.Вставить("Кампания", Выборка.Кампания);
	ОписаниеЗаписи.Вставить("Источник", Выборка.Источник);
	ОписаниеЗаписи.Вставить("Назначение", Выборка.Назначение);
	ОписаниеЗаписи.Вставить("ТипСвязи", Выборка.ТипСвязи);
	ОписаниеЗаписи.Вставить("Комментарий", Выборка.Комментарий);
	Возврат ОписаниеЗаписи;

КонецФункции

// Создает новую запись регистра сведений СвязиСущностей.
Процедура СоздатьЗаписьСвязи(Кампания, Источник, Назначение, ТипСвязи, Комментарий)

	Запись = РегистрыСведений.СвязиСущностей.СоздатьМенеджерЗаписи();
	Запись.Кампания = Кампания;
	Запись.Источник = Источник;
	Запись.Назначение = Назначение;
	Запись.ТипСвязи = ТипСвязи;
	Запись.Комментарий = Комментарий;
	Запись.Записать();

КонецПроцедуры

// Обновляет комментарий у существующей записи регистра.
Процедура ОбновитьКомментарийЗаписи(ОписаниеЗаписи, Комментарий)

	НаборЗаписей = РегистрыСведений.СвязиСущностей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Кампания.Установить(ОписаниеЗаписи.Кампания);
	НаборЗаписей.Отбор.Источник.Установить(ОписаниеЗаписи.Источник);
	НаборЗаписей.Отбор.Назначение.Установить(ОписаниеЗаписи.Назначение);
	НаборЗаписей.Отбор.ТипСвязи.Установить(ОписаниеЗаписи.ТипСвязи);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	НаборЗаписей[0].Комментарий = Комментарий;
	НаборЗаписей.Записать();

КонецПроцедуры

// Формирует описание связи на основании строки выборки запроса.
// Результат расширен признаком Симметричная, чтобы вызывающий код
// мог единообразно интерпретировать семантику направления относительно
// исходного объекта, не обращаясь к справочнику ТипыСвязей повторно.
//
// Параметры:
//   Объект  - ОпределяемыйТип.СущностиКампании - исходная сущность,
//             для которой запрашивались связи.
//   Выборка - ВыборкаИзРезультатаЗапроса - строка результата запроса.
//
// Возвращаемое значение:
//   Структура:
//     * Объект             - ОпределяемыйТип.СущностиКампании
//     * СвязанныйОбъект    - ОпределяемыйТип.СущностиКампании
//     * ТипСвязи           - СправочникСсылка.ТипыСвязей
//     * ПредставлениеСвязи - Строка
//     * Направление        - Строка
//     * Комментарий        - Строка
//     * Симметричная       - Булево
//
Функция ОписаниеСвязи(Объект, Выборка)

	ЭтоИсходящая = (Выборка.Источник = Объект);

	Описание = Новый Структура;
	Описание.Вставить("Объект", Объект);
	Описание.Вставить("ТипСвязи", Выборка.ТипСвязи);
	Описание.Вставить("Комментарий", Выборка.Комментарий);

	Если ЭтоИсходящая Тогда
		Описание.Вставить("СвязанныйОбъект", Выборка.Назначение);
		Описание.Вставить("Направление", "Исходящая");
		Описание.Вставить("ПредставлениеСвязи", Выборка.НаименованиеТипа);
	Иначе
		Описание.Вставить("СвязанныйОбъект", Выборка.Источник);
		Описание.Вставить("Направление", "Входящая");
		Описание.Вставить("ПредставлениеСвязи",
			?(Выборка.Симметричная, Выборка.НаименованиеТипа, Выборка.ОбратноеНаименование));
	КонецЕсли;

	Описание.Вставить("Симметричная", Выборка.Симметричная = Истина);

	Возврат Описание;

КонецФункции

// Возвращает стабильный machine-readable код типа связи по её ссылке.
// Код формируется из имени предопределённого элемента справочника
// ТипыСвязей и не зависит от внутренней нумерации (Код) или
// пользовательского представления (Наименование, ОбратноеНаименование).
//
// Используется в AI-контракте (get_relations) как стабильный
// идентификатор типа связи в JSON DTO. Добавление новых предопределённых
// типов требует расширения СоответствиеСтабильныхКодов() в этом модуле.
//
// Параметры:
//   ТипСвязи - СправочникСсылка.ТипыСвязей - ссылка на тип связи.
//
// Возвращаемое значение:
//   Строка - стабильный код типа связи, либо пустая строка, если
//            соответствие не определено (не предопределённый элемент
//            или нераспознанное имя предопределённого).
//
Функция СтабильныйКодТипаСвязи(ТипСвязи) Экспорт

	Если НЕ ЗначениеЗаполнено(ТипСвязи) Тогда
		Возврат "";
	КонецЕсли;

	ИмяПредопределенного = ИмяПредопределенногоТипаСвязи(ТипСвязи);
	Если ПустаяСтрока(ИмяПредопределенного) Тогда
		Возврат "";
	КонецЕсли;

	Соответствие = СоответствиеСтабильныхКодов();
	Результат = Соответствие.Получить(ИмяПредопределенного);
	Если Результат = Неопределено Тогда
		Возврат "";
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Возвращает имя предопределённого элемента справочника ТипыСвязей
// для переданной ссылки. Для пользовательских (не предопределённых)
// элементов возвращает пустую строку.
//
// Параметры:
//   ТипСвязи - СправочникСсылка.ТипыСвязей - ссылка на тип связи.
//
// Возвращаемое значение:
//   Строка - имя предопределённого элемента, либо "" для не-предопределённых.
//
Функция ИмяПредопределенногоТипаСвязи(ТипСвязи)

	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТипСвязи, "ИмяПредопределенныхДанных");

КонецФункции

// Единственный источник соответствия имя предопределённого элемента ->
// стабильный machine-readable код типа связи.
//
// Используется как AI-контракт: не зависит от внутренней нумерации
// справочника (Код) и от пользовательского представления
// (Наименование/ОбратноеНаименование). Расширение соответствия
// при добавлении новых предопределённых типов выполняется через
// изменение этой функции.
//
// Возвращаемое значение:
//   Соответствие - ключ Строка (имя предопределённого элемента),
//                  значение Строка (стабильный код типа связи).
//
Функция СоответствиеСтабильныхКодов()

	Соответствие = Новый Соответствие;
	Соответствие.Вставить("СвязанС",     "related_to");
	Соответствие.Вставить("НаходитсяВ",   "located_in");
	Соответствие.Вставить("Владеет",      "owns");
	Соответствие.Вставить("СостоитВ",     "member_of");
	Соответствие.Вставить("ВыдалКвест",   "gave_quest");
	Соответствие.Вставить("Союзник",      "ally");
	Соответствие.Вставить("Враг",         "enemy");
	Соответствие.Вставить("Знаком",       "acquainted");

	Возврат Соответствие;

КонецФункции

#КонецОбласти
